[
    {
      "image": "https://i.ibb.co/1qrbJfr/luxury-villa.jpg",
      "estate_title": "Luxury Villa",
      "id": "001",
      "segment_name": "Residential",
      "description": "A stunning villa with panoramic views",
      "long_description": "Immerse yourself in the idyllic charm of country living with this exceptional rustic farmhouse, meticulously designed to blend timeless architectural details with modern conveniences. Nestled on a sprawling lot enveloped by nature's tranquility, this farmhouse offers an unparalleled retreat from the hustle and bustle of urban life. The exterior showcases a classic farmhouse design with a warm and inviting facade, featuring a wrap-around porch adorned with fragrant climbing roses and comfortable seating areas. The porch serves as an ideal spot for morning coffee, afternoon tea, or simply unwinding with a good book while enjoying the gentle breezes and scenic views of the surrounding countryside. Step inside, and you're greeted by an interior that seamlessly combines rustic charm with contemporary elegance. The heart of the home is the expansive living room, featuring exposed wooden beams, a cozy stone fireplace, and large windows that flood the space with natural light, creating a welcoming ambiance perfect for relaxation and family gatherings. The farmhouse's kitchen is a chef's dream, boasting high-end stainless steel appliances, custom-built cabinetry, and a generous island with butcher block countertops. Whether you're preparing a gourmet meal or a simple family dinner, this kitchen provides everything you need to cook with ease and style. Adjacent to the kitchen is a spacious dining area, perfect for hosting dinner parties or enjoying family meals. The farmhouse offers multiple bedrooms, each designed to provide a peaceful retreat at the end of the day. The master suite is a luxurious haven, featuring a vaulted ceiling, a private balcony overlooking the picturesque landscape, and a spa-like en-suite bathroom complete with a soaking tub and walk-in shower. The additional bedrooms are equally inviting, offering ample space, plush bedding, and charming decor that reflects the farmhouse's rustic yet refined aesthetic. Beyond the main living areas, the farmhouse also boasts versatile spaces that can be tailored to suit your lifestyle and interests. A cozy reading nook with built-in bookshelves offers a quiet spot for literary enthusiasts, while a sun-drenched home office provides a productive workspace for remote work or creative projects. The farmhouse also includes a spacious laundry room with state-of-the-art appliances and plenty of storage space, making household chores a breeze. One of the highlights of this farmhouse is its expansive outdoor area, featuring meticulously landscaped gardens, mature trees, and a variety of outdoor living spaces. The gardens are a gardener's paradise, filled with perennial flowers, vegetable patches, and fruit trees, allowing you to indulge in your passion for gardening and cultivate your own organic produce. For those who love outdoor entertaining, the farmhouse offers a multitude of options. A large patio equipped with comfortable seating, a built-in grill, and a fire pit is perfect for hosting summer barbecues, while a charming gazebo nestled among the trees provides a romantic setting for al fresco dining under the stars. The farmhouse also includes several practical amenities designed to enhance your comfort and convenience.",
      "price": "$1,500,000",
      "status": "sale",
      "area": "5000 sq ft",
      "location": "Los Angeles, CA",
      "facilities": ["living room", "swimming pool", "kitchen"],
      "view_property": "View Property"
    },
    {
      "image": "https://i.ibb.co/DQjSnd0/Beachfront-Condo.jpg",
      "estate_title": "Beachfront Condo",
      "id": "002",
      "segment_name": "Residential",
      "description": "Modern condo with direct beach access",
      "long_description": "Embrace the coastal lifestyle in this modern beachfront condo. This two-bedroom residence is designed with sophistication and comfort in mind, featuring an open-concept living area, high-end finishes, and floor-to-ceiling windows that capture breathtaking ocean views. The master suite offers a luxurious retreat with a spa-like bathroom and private balcony overlooking the sea. Residents can enjoy resort-style amenities, including a fitness center, spa, and beachfront pool. Located steps away from the beach, dining, and entertainment, this condo offers the perfect blend of luxury and convenience.",
      "price": "$800,000",
      "status": "sale",
      "area": "1500 sq ft",
      "location": "Miami, FL",
      "facilities": ["living room", "gym", "kitchen"],
      "view_property": "View Property"
    },
    {
      "image": "https://i.ibb.co/ZgVQxB3/downtownloft.jpg",
      "estate_title": "Downtown Loft",
      "id": "003",
      "segment_name": "Commercial",
      "description": "Spacious loft in the heart of the city",
      "long_description": "Live and work in style in this spacious downtown loft. This expansive two-bedroom loft features high ceilings, exposed brick walls, and industrial-chic design elements. The open-concept living area is ideal for entertaining, with a gourmet kitchen, dining space, and cozy seating area. The loft includes a versatile workspace, perfect for remote work or creative projects. Located in the heart of the city, residents enjoy easy access to the best dining, shopping, and entertainment venues. With secure parking and a private rooftop terrace, this loft offers a unique and inspiring urban living experience.",
      "price": "$3,000/month",
      "status": "rent",
      "area": "2200 sq ft",
      "location": "New York, NY",
      "facilities": ["living room", "rooftop terrace", "kitchen"],
      "view_property": "View Property"
    },
    {
      "image": "https://i.ibb.co/mhW6N7d/mountain-retreat.jpg",
      "estate_title": "Mountain Retreat",
      "id": "004",
      "segment_name": "Residential",
      "description": "Cozy cabin nestled in the mountains",
      "long_description": "Escape to the serene beauty of this cozy mountain cabin. This charming three-bedroom cabin is nestled among towering pine trees, offering breathtaking mountain views and a peaceful retreat from city life. The open-concept living area features a wood-burning fireplace, rustic wood finishes, and comfortable furnishings, creating a warm and inviting atmosphere. The spacious deck is perfect for outdoor dining and relaxing, while the private hot tub offers the ultimate in relaxation. With hiking trails and outdoor activities right at your doorstep, this cabin is a nature lover's paradise.",
      "price": "$400,000",
      "status": "sale",
      "area": "1800 sq ft",
      "location": "Denver, CO",
      "facilities": ["living room", "fireplace", "kitchen"],
      "view_property": "View Property"
    },
    {
      "image": "https://i.ibb.co/M5BPf7b/Urban-Apartment.jpg",
      "estate_title": "Urban Apartment",
      "id": "005",
      "segment_name": "Residential",
      "description": "Chic apartment with city skyline views",
      "long_description": "Experience urban living at its finest in this chic apartment with stunning city skyline views. This luxurious two-bedroom apartment features an open-concept layout, high-end finishes, and floor-to-ceiling windows that flood the space with natural light. The master suite offers a private sanctuary with a spa-like bathroom and a walk-in closet. Residents can enjoy exclusive amenities, including a fitness center, rooftop pool, and concierge service. Located in the heart of the city, this apartment offers easy access to dining, shopping, and entertainment, making it the perfect urban retreat.",
      "price": "$1,200,000",
      "status": "sale",
      "area": "1600 sq ft",
      "location": "San Francisco, CA",
      "facilities": ["living room", "balcony", "kitchen"],
      "view_property": "View Property"
    },
    {
      "image": "https://i.ibb.co/f8tDMKr/penthouse.jpg",
      "estate_title": "Luxury Penthouse",
      "id": "006",
      "segment_name": "Residential",
      "description": "Elegant penthouse with luxury amenities",
      "long_description": "Indulge in luxury living in this elegant penthouse with premium amenities. This expansive three-bedroom penthouse boasts a gourmet kitchen, formal dining room, and a grand living area with panoramic city views. The master suite is a luxurious retreat with a spa-like bathroom, dressing room, and private balcony. The penthouse also features a private rooftop terrace with a jacuzzi, perfect for entertaining or relaxing with friends and family. Located in a prestigious building with concierge service, security, and underground parking, this penthouse offers the ultimate in comfort, privacy, and convenience.",
      "price": "$5,000/month",
      "status": "rent",
      "area": "3000 sq ft",
      "location": "Chicago, IL",
      "facilities": ["living room", "jacuzzi", "kitchen"],
      "view_property": "View Property"
    },
    {
      "image": "https://i.ibb.co/Xt01ZqJ/Lakefront-Mansion.jpg",
      "estate_title": "Lakefront Mansion",
      "id": "007",
      "segment_name": "Residential",
      "description": "Majestic mansion with lake views",
      "long_description": "Step into a world of luxury in this majestic lakefront mansion. Situated on a prime waterfront lot, this mansion offers breathtaking lake views and unparalleled privacy. With grand living spaces, a gourmet kitchen, and resort-style outdoor amenities, this mansion is a true masterpiece of design and craftsmanship.",
      "price": "$2,500,000",
      "status": "sale",
      "area": "7000 sq ft",
      "location": "Seattle, WA",
      "facilities": ["living room", "swimming pool", "kitchen"],
      "view_property": "View Property"
    },
    {
      "image": "https://i.ibb.co/1d95rKp/golf-course-villa.jpg",
      "estate_title": "Golf Course Villa",
      "id": "008",
      "segment_name": "Residential",
      "description": "Elegant villa overlooking a golf course",
      "long_description": "Live the resort lifestyle in this elegant villa overlooking a pristine golf course. This luxurious four-bedroom villa features sweeping views of the fairways and manicured greens, offering a tranquil and luxurious living environment. The spacious interiors are designed with comfort and elegance in mind, featuring high ceilings, large windows, and upscale finishes. The villa's outdoor area includes a private pool, landscaped garden, and a covered terrace, perfect for outdoor dining and entertaining. Residents also have access to exclusive golf club amenities, including a clubhouse, fitness center, and tennis courts.",
      "price": "$1,700,000",
      "status": "sale",
      "area": "4500 sq ft",
      "location": "Orlando, FL",
      "facilities": ["living room", "golf course view", "kitchen"],
      "view_property": "View Property"
    },
    {
        "image": "https://i.ibb.co/pfLwhQk/rustic-farmhouse.jpg",
        "estate_title": "Rustic Farmhouse",
        "id": "009",
        "segment_name": "Residential",
        "description": "Charming farmhouse with rustic charm",
        "long_description": "Experience the charm of country living in this rustic farmhouse nestled on a spacious lot. With exposed beams, a cozy fireplace, and a wrap-around porch, this farmhouse exudes warmth and character. The expansive kitchen is perfect for family gatherings and features modern appliances and ample counter space. Retreat to the master suite with its own private balcony overlooking the scenic countryside. Outside, the sprawling grounds offer endless possibilities for outdoor activities, from gardening in the vegetable patch to hosting summer barbecues with friends and family. Enjoy the tranquility of rural life while still being just a short drive away from the conveniences of town. Whether you're seeking a weekend retreat or a permanent residence, this farmhouse offers a timeless blend of comfort and style.",
        "price": "$600,000",
        "status": "sale",
        "area": "2500 sq ft",
        "location": "Nashville, TN",
        "facilities": ["living room", "garden", "kitchen"],
        "view_property": "View Property"
    }
]
  